{"authors": [], "date_download": "2024-10-12 13:41:03", "date_modify": "2024-10-12 13:41:03", "date_publish": "2024-08-27 23:28:09", "description": "NEW DELHI - India's Jay Shah will succeed New Zealander Greg Barclay as chairman of the International Cricket Council (ICC) later this year, the governing body said on Tuesday. Read more at straitstimes.com.", "filename": "sport_indias-shah-elected-icc-chief-after-barclay-steps-aside_1728740463.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/27/LYNXMPEK7Q0NM-2.jpg?VersionId=rOUY28RR611.aZp6JuYSii9xnDyBTJrn", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_indias-shah-elected-icc-chief-after-barclay-steps-aside_1728740463.html", "title": "India's Shah elected ICC chief after Barclay steps aside", "title_page": "India's Shah elected ICC chief after Barclay steps aside | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW DELHI - India's Jay Shah will succeed New Zealander Greg Barclay as chairman of the International Cricket Council (ICC) later this year, the governing body said on Tuesday.\nThe 35-year-old Shah, son of Prime Minister Narendra Modi's home minister Amit Shah, will be the youngest ever ICC chairman when be begins his tenure on Dec. 1.\nBarclay decided against seeking a third term and Shah, considered the game's most influential administrator as the secretary of the world's richest cricket board, was the sole candidate, the ICC said.\nShah, also president of the Asian Cricket Council, said he was committed to spreading the game, which will return to the Olympics after a gap of 128 years at the 2028 Los Angeles Games.\n\"We stand at a critical juncture where it is increasingly important to balance the coexistence of multiple formats, promote the adoption of advanced technologies, and introduce our marquee events to new global markets,\" he said.\n\"Our goal is to make cricket more inclusive and popular than ever before.\"\n\"The inclusion of our sport in the Olympics at LA 2028 represents a significant inflection point for the growth of cricket, and I am confident that it will drive the sport forward in unprecedented ways.\" REUTERS", "url": "https://www.straitstimes.com/sport/indias-shah-elected-icc-chief-after-barclay-steps-aside"}