{"authors": [], "date_download": "2024-10-12 13:35:19", "date_modify": "2024-10-12 13:35:19", "date_publish": "2024-07-16 02:18:45", "description": "The final was delayed by 82 minutes as security struggled to process the safe entry of fans into the stadium. Read more at straitstimes.com.", "filename": "sport_football_copa-america-chaos-raises-concerns-for-2026-world-cup_1728740119.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/16/2024-07-15T003626Z183059480723743426RTRMADP3SOCCER-USA.JPG?VersionId=_3cpGMej7ZuKPfKJWzDeyn_qoTeEP2BT", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_copa-america-chaos-raises-concerns-for-2026-world-cup_1728740119.html", "title": "Copa America chaos raises concerns for 2026 World Cup", "title_page": "Copa America chaos raises concerns for 2026 World Cup | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MIAMI – The chaotic scenes at the Copa America final have raised serious questions for the organisers of the 2026 World Cup, which will be held in North America.\nThe start of the July 14 final between Colombia and Argentina at Miami’s Hard Rock Stadium was delayed by 82 minutes as overwhelmed security struggled to process the safe entry of fans into the stadium.\nOrganisers blamed ticketless fans rushing through entry points at the venue for their decision to keep the gates closed for almost three hours after the planned opening time.\nBut, while there was plenty of evidence of ticketless fans entering, it was also clear that the security system was unable to cope.\nSome fans needed medical attention for heat exhaustion after being stuck in the crush around the fencing at the entrance to the 65,000-capacity venue amid alarming scenes.\nMeanwhile, Colombian Football Federation president Ramon Jesurun has been released on bail following his arrest at the final, according to videos published in Colombian media on July 15.\nA Miami-Dade County police file indicated that Jesurun, 71, had been arrested on charges of “assault on officer/employee” on July 14 at Hard Rock Stadium.\nSecurity guards refused Jesurun, who was with his son and other family members, access to the field for the awards ceremony. A scuffle broke out and Jesurun and his son were arrested, Colombian newspaper El Tiempo reported.\nHard Rock Stadium will host seven games at the 2026 World Cup, which the United States is co-hosting with Mexico and Canada.\nThe Copa America was organised by South American confederation Conmebol, while the World Cup will be controlled by global governing body Fifa and its local organisation.\n“This is not a good look,” said former US international Alexi Lalas, now a leading television pundit for Fox Sports.\n“I understand this is not a good look for Conmebol and this is also, because it is happening on our watch, in our country, not a good look for the US less than two years out from the World Cup.”\nFifa, who had no role in the running of the Copa, did not immediately comment on the incidents, but sources indicated they would now intensify discussions with stadiums over their security plans.\nA former stadium employee, who spoke to AFP on the condition of anonymity, said that the incident at Hard Rock was down to bad organisation.\n“I know this facility like the back of my hand, this should never happen,” he said, after spending over two hours in the crush outside the ground.\n“This is an embarrassment, for Conmebol, for the Hard Rock Stadium, an embarrassment that should never happen,” he added.", "url": "https://www.straitstimes.com/sport/football/copa-america-chaos-raises-concerns-for-2026-world-cup"}