{"authors": [], "date_download": "2024-10-12 14:12:09", "date_modify": "2024-10-12 14:12:09", "date_publish": "2024-05-09 13:48:23", "description": "He shrugged off injury to spark a sensational second-half fightback in their 130-121 win for a 2-0 series lead. Read more at straitstimes.com.", "filename": "sport_basketball_battling-jalen-brunson-fires-ny-knicks-over-indiana-pacers_1728742329.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/05/09/BKN-SPO-INDIANA-PACERS-V-NEW-YORK-KNICKS-GAME-TWO-025215.jpg?VersionId=OD46Uq3Bif3O2kwPmz_svqOkrvouOtBe", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_basketball_battling-jalen-brunson-fires-ny-knicks-over-indiana-pacers_1728742329.html", "title": "Battling Jalen Brunson fires New York Knicks over Indiana Pacers in NBA play-offs", "title_page": "Battling Jalen Brunson fires New York Knicks over Indiana Pacers in NBA play-offs | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK – At half-time in game 2 of the National Basketball Association (NBA) Eastern Conference semi-finals on May 8, the crowd at the Madison Square Garden chanted “MVP! MVP!” when Jalen Brunson started to warm up again.\nThe New York Knicks guard, however, tried his best to block out the noise, and the pain in his body, to remain focused.\n“It was really cool to hear, but I just knew that I had to get my mind in the right place to figure out how I was going to attack the second half,” he said on ESPN.\nThat worked as he eventually shrugged off injury to spark a sensational second-half fightback, as the Knicks battled past the Indiana Pacers 130-121 to take a 2-0 lead in their best-of-seven play-off series.\nThe New York talisman gave his team a huge scare after suffering a foot issue in the first quarter which forced him to sit out the remainder of the half.\nIndiana exploited Brunson’s absence to open up a 10-point advantage by half-time and were soon 12 points up in the third quarter after an early Andrew Nembhard lay-up.\nBut a limping Brunson – who returned at the start of the third quarter – led a stunning rally as the Knicks outscored Indiana 36-18 in the third to take a 99-91 lead into the fourth quarter.\nThe Knicks then dug deep to hold onto their advantage in the final period, outscoring the Pacers 31-30 to close out a famous victory.\nBrunson finished with 29 points and five assists while Donte DiVincenzo and O.G. Anunoby had 28 points apiece.\n“I mean, he’s a warrior,” DiVincenzo said of Brunson.\n“There was no doubt in my mind that he’ll be back. All season long, no matter what is thrown at him, injury bug or whatever, he always bounces back... Everybody had confidence he was coming back.”\nJosh Hart added 19 points with 15 rebounds, while Isaiah Hartenstein was huge defensively, with 12 rebounds, eight assists and 14 points.\n“We found a way, that’s it,” added an exhausted Brunson.\n“For us it starts with our habits – we’ve talked about doing the little things a little bit better, because you never know when they’re going to help you in a big game.\n“It’s all about doing the little things well every single day, and we pride ourselves on that.”\nThe victory came at a cost though for the Knicks, who were already missing injured first-choice players Julius Randle, Mitchell Robinson and Bojan Bogdanovic.\nAs well as the injury to Brunson, the team saw another player injured with Anunoby limping out of the game in the third quarter with a hamstring problem.\nSomehow, the Knicks hung on to edge past the Pacers, with Brunson pouring in 14 fourth-quarter points and DiVincenzo adding eight points including two crucial three-pointers that helped keep Indiana at arm’s length.\nKnicks coach Tom Thibodeau revealed that the squad were uncertain of whether Brunson would continue after missing the second quarter, despite DiVincenzo’s conviction that he would.\n“We didn’t know if he was going to be able to go or not, but he found a way to get it done,” he said.\nTyrese Haliburton led Indiana’s scorers with 34 points while Nembhard finished with 15 points and Pascal Siakam 14. Obi Toppin added 20 from the bench.\nIn other news, Nikola Jokic thanked his “one big circle” at the Denver Nuggets after he was named NBA Most Valuable Player for the third time in four seasons.\nThe 29-year-old Serb, who won the award in 2021 and 2022, finished runner-up in the voting in 2023 to Joel Embiid of the Philadelphia 76ers.\nThis season he averaged 26.4 points, 12.4 rebounds and 9.0 assists in the regular season and beat out Oklahoma City Thunder star Shai Gilgeous-Alexander and Luka Doncic of the Dallas Mavericks in final voting.\n“We’ve got to start with the teammates. Without them I cannot do anything,” Jokic said.\n“Coaches, players, organisation, medical staff, across time coaches, development coaches – it’s all one big circle that I cannot be wherever I am without them.” AFP, REUTERS", "url": "https://www.straitstimes.com/sport/basketball/battling-jalen-brunson-fires-ny-knicks-over-indiana-pacers"}