{"authors": ["Laura Chia"], "date_download": "2024-10-12 14:22:00", "date_modify": "2024-10-12 14:22:00", "date_publish": "2019-05-12 13:08:33", "description": "SINGAPORE - During the OCBC Cycle Mighty Savers Family Ride on Saturday (May 11), she had to settle for watching her two children have fun from the sidelines as her family car could transport only two bicycles at once. Read more at straitstimes.com.", "filename": "sport_cycling-mums-turn-to-have-fun-at-ocbc-cycle-on-mothers-day_1728742920.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2019/05/12/wc-cycle-1205.jpg?VersionId=8GI3PAEqEVDJD5TJDXqinEsPplUHkJVF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_cycling-mums-turn-to-have-fun-at-ocbc-cycle-on-mothers-day_1728742920.html", "title": "Cycling: Mum's turn to have fun at OCBC Cycle on Mother's Day", "title_page": "Cycling: Mum's turn to have fun at OCBC Cycle on Mother's Day | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - During the OCBC Cycle Mighty Savers Family Ride on Saturday (May 11), she had to settle for watching her two children have fun from the sidelines as her family car could transport only two bicycles at once.\nBut on Sunday, it was homemaker Khushnam Badshaw's turn to have fun as she had the perfect start to Mother's Day, riding in the 23km The Straits Times Ride with her husband Kaizad Badshaw.\nIt was her first time participating in the OCBC Cycle and she enjoyed the experience immensely.\n\"I was really excited and it was good bonding time with my husband. We took many photos on the Sheares Bridge as well,\" said the 36-year-old. \"The enthusiasm from everyone is contagious and the energy from them spurs you on to finish the ride.\"\nKaizad, also 36, added: \"It's fun because you can go on the city roads and you don't get to do that on a daily basis.\n\"I had good company this time as I normally cycle alone so it was good to be able to chit-chat and ride at the same time.\"\nThe couple were among nearly 6,800 people who participated in the 11th OCBC Cycle's community rides - The ST Ride (23km) and The Sportive Ride (42km) - at the Singapore Sports Hub on Sunday. The riders rode past landmarks such as the Singapore Flyer, Marina Bay Sands and Gardens by the Bay.\nThe ST Ride also attracted a handful of para cyclists from the Para Cycling Federation of Singapore. One of them was hand cyclist Prashant Arkal, 33, who has been preparing for the event for about three months.\n\"It was quite a different experience cycling here because normally, in other para-cycling events, there are not many participants but with the crowd and climbs in the route, it became a technical race for me while other races were more focused on speed,\" said the IT software engineer.\nStudent Evan Chng thought pedalling up the Sheares Bridge was the most challenging part of his ride.\n\"I haven't cycled uphill before but it was a good challenge. It was a relaxing ride. Most of the time in Singapore, there are a lot of cars around so I normally can't really concentrate, so cycling in such events is nice and I really enjoyed the scenery,\" said the 17-year-old.\nEducator June Tham found that the climbs made the ride more exciting.\n\"It's the adrenaline rush you get when you're cycling up the hills,\" said the 37-year-old, who was participating in the 42km Sportive Ride for the first time. \"This event also encourages people to practise healthy living and gets the community to exercise together. I enjoyed that aspect as you could feel everyone's spirit and resilience as they just wanted to finish the whole route together and not give up.\"\nRetiree Simon Teo, who has been participating in The ST Ride since the first edition of the OCBC Cycle, sets time limits for himself every year to improve and hopes to encourage more people to maintain a healthy lifestyle.\n\"When you cycle, you can go long distances and you can see a lot of things people cannot see. Cycling takes you anywhere you want,\" said the 71-year-old, who is teaching his four-year-old granddaughter to cycle and aims to sign her up for next year's Family Ride.\n\"Age is just a number. You just need to set goals for yourself, pace yourself and anyone can do it. It's a personal challenge for me and builds personal discipline and endurance.\n\"I'm also trying to set an example for my family members to be active.\n\"I really enjoy the mass participation aspect and the environment here because it's not a race and you can take your time to look at the scenery. And everyone waves to each other and encourages each other along the way.\"", "url": "https://www.straitstimes.com/sport/cycling-mums-turn-to-have-fun-at-ocbc-cycle-on-mothers-day"}