{"authors": [], "date_download": "2024-10-12 13:42:53", "date_modify": "2024-10-12 13:42:53", "date_publish": "2023-11-30 05:32:48", "description": "United are on the brink of elimination after blowing a two-goal lead to draw 3-3 at Galatasaray. Read more at straitstimes.com.", "filename": "sport_football_manchester-united-have-to-be-smarter-in-champions-league-says-bruno-fernandes_1728740573.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/30/FBL-EUR-C1-GALATASARAY-MANCHESTERUNITED-202644.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_manchester-united-have-to-be-smarter-in-champions-league-says-bruno-fernandes_1728740573.html", "title": "Manchester United have to be 'smarter' in Champions League, says Bruno Fernandes", "title_page": "Manchester United have to be 'smarter' in Champions League, says Bruno Fernandes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "ISTANBUL - Manchester United captain Bruno Fernandes criticised his side’s lack of control in Champions League games after again blowing a two-goal lead to draw 3-3 at Galatasaray on Nov 29.\nThe English giants are on the brink of elimination at the group stage after winning just one of their opening five matches.\nUnited must beat German champions Bayern Munich at home in their final Group A game and hope other results go their way to reach the last 16.\nBut the whole campaign has been a tale of missed opportunities for the Red Devils.\nTwice they led Galatasaray at home before losing 3-2 in October, while they let a two-goal lead slip in a 4-3 defeat to FC Copenhagen earlier this month.\nFernandes’ stunning strike put United 2-0 up in Istanbul within 20 minutes and they also led 3-1 after an hour.\nHowever, two costly errors from goalkeeper Andre Onana allowed Hakim Ziyech free-kicks to reduce Galatasaray’s deficit and they earned a point through Kerem Akturkoglu.\n“It’s too bad to be honest,” Fernandes told TNT Sports.\n“What we have been doing in the Champions League is not enough, we have to control our games.\n“It’s not the first time, even Copenhagen, I understand we had one player less, but we score the 3-2 and we have to secure the result.\n“We have to understand these type of games, these stages, you have to be smart enough and manage the game better.\n“Everyone has to step up and take responsibility of their own mistakes.” AFP", "url": "https://www.straitstimes.com/sport/football/manchester-united-have-to-be-smarter-in-champions-league-says-bruno-fernandes"}