{"authors": [], "date_download": "2024-10-12 13:43:28", "date_modify": "2024-10-12 13:43:28", "date_publish": "2024-09-21 05:45:33", "description": "City midfielder Rodri had suggested players could go on strike over the number of matches they have to play. Read more at straitstimes.com.", "filename": "sport_football_guardiola-tells-players-to-lead-change-over-workload-as-kompany-demands-cap-on-games_1728740608.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/21/2024-09-18T193449Z1428453023UP1EK9I1IDZXORTRMADP3SOCCER-CHAMPIONS-MCI-INT-REPORT.JPG?VersionId=HE9ljJZRVbrKQLfp8mqMvlJdb.LjOYth", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_guardiola-tells-players-to-lead-change-over-workload-as-kompany-demands-cap-on-games_1728740608.html", "title": "Pep Guardiola tells players to lead change over workload, as Vincent Kompany demands cap on games", "title_page": "Pep Guardiola tells players to lead change over workload, as Vincent Kompany demands cap on games | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Manchester City manager Pep Guardiola on Sept 20 urged players to lead the fight for change in the heated debate over the dangers posed by an increased fixture schedule, as Bayern Munich coach Vincent Kompany demanded a cap on games.\nCity midfielder Rodri recently suggested players would consider going on strike in a bid to halt the dramatic rise in matches crammed into an already hectic calendar.\nWith the Champions League first stage now featuring an additional two matches and the expanded Club World Cup at the end of the season, Guardiola’s English Premier League champions could play a maximum of 76 matches during the 2024-25 campaign.\nTop players also have international fixtures to factor into the gruelling schedule.\nGlobal players’ union Fifpro has said footballers should play a maximum of 50 to 60 games per season, depending on their age.\nLiverpool goalkeeper Alisson Becker joined the row when he said players were not given a voice by the sport’s authorities to express their concerns.\nAs the debate intensifies, Guardiola says players have the power to spark change because the sport cannot go on without them.\n“I’m pretty sure that if something is going to change, it must come from the players,” he said.\n“They are the only ones who can change something about the organisation, to take a voice.\n“The business can be without managers, sporting directors, media, owners but without players you cannot play. The only ones with the power to do it are them.”\nEnzo Maresca’s Chelsea will, like City, take part in the Club World Cup in the United States at a time when the players would otherwise be resting.\nThe Italian hinted a strike could be a course of action to tackle the problem.\nAsked whether there are too many games in the current calendar, Maresca said: “Yes, no doubt. In terms of games, it’s too much.\n“I don’t think we protect players. We can say what we think and for me it’s completely wrong the amount of games that we have.\n“The only ones that can do something are the players and we can help them. In the last two weeks some of the players have tried to explain what they think. I think it’s a good starting point.\n“Some of them have said (they could strike). I think it could be an idea for them.”", "url": "https://www.straitstimes.com/sport/football/guardiola-tells-players-to-lead-change-over-workload-as-kompany-demands-cap-on-games"}