{"authors": [], "date_download": "2024-10-12 14:13:16", "date_modify": "2024-10-12 14:13:16", "date_publish": "2024-07-25 18:41:47", "description": "The Olympic project is almost unthinkable in its audacity, in its transformation of a great city into a stadium. Read more at straitstimes.com.", "filename": "sport_a-city-of-light-and-shadows-is-redrawn-for-the-olympics_1728742396.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/25/2024-07-25T094223Z2064986092UP1EK7P0QYL9NRTRMADP3OLYMPICS-2024-BEACHVOLLEYBALL.JPG?VersionId=6MLLXW2512Yev4nZWzjTwMZJX8g3P9N1", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_a-city-of-light-and-shadows-is-redrawn-for-the-olympics_1728742396.html", "title": "A City of Light and Shadows is redrawn for the Olympics", "title_page": "A City of Light and Shadows is redrawn for the Olympics | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS – There is a glorious folly to the Paris Olympics, the first in the city since 1924, as if France in its perennial revolutionary ardour took a century to ponder something unimaginable, the transformation of a great city into a stadium.\nThe heart of Paris has fallen silent in preparation for the opening ceremony on July 26, when a flotilla will usher thousands of athletes down the Seine, under the low-slung bridges where lovers like to linger. Not since the Covid-19 pandemic has the city been so still or so constrained.\nRoads are closed; newly built stands for spectators line the riverbanks; fences enclose sidewalks; and residents need police-issued QR codes to reach their homes. The golden cherubs, nymphs and winged horses of the Pont Alexandre III gaze out on metal bleachers and posses of police.\nThe Olympic project is almost unthinkable in its audacity, and a major security headache, but then again, the Eiffel Tower would never have risen above Paris in 1889 if the many naysayers had prevailed.\nNow, between its first and second floors, five giant Olympic rings adorn the tower. They glow at night over the Champ de Mars park, where the beach volleyball competition will be held.\nNearby flows the Seine, beautified at a cost of about US$1.5 billion (S$2 billion) and clean enough, it is said after several false starts, for several Olympic events, including two 10km swims and the triathlon.\nSwimming in the Seine was banned 101 years ago. All things come to an end. These Games, at a cost of about US$4.75 billion, were conceived to be transformative in a lasting, environmentally conscious way.\n“We wanted a dash of revolution, something the French would look back at with pride,” said Tony Estanguet, the head of the Paris Olympics committee.\nParis has seen its share of upheaval over the centuries. To walk its streets is to be accompanied by history and to be ambushed from time to time, even after many years, by some previously unnoticed inflection of beauty.\nWonderment is a common condition here. The way the light falls – on a golden dome, or through the leaves of the plane trees, or on the limestone walls of a handsome boulevard, or across the shimmering water of the Seine at dusk – stops visitors in their tracks.\nThe City of Light is also the city of etched shadows, ever redrawing its lines. It is also a city of formality and refuge.\nQuiet spaces abut architectural grandeur.\nYou are never far from magnificence, perhaps most extravagantly illustrated by Napoleon Bonaparte’s tomb at the Hotel des Invalides, but never far, either, from an unsuspected covered arcade, like the Passage Verdeau, that snakes from a Grand Boulevard into an intimate world.\nEven in the approaches to the Grand Palais, gravel paths lead through secluded greenery. The immense palace, with its classical stone facade and vaulted roof of iron, steel and glass, will host the taekwondo and fencing events. It seems a suitable setting for the sabre.\nA little farther down, at the Place de la Concorde, athletes in three-a-side basketball, break dancing and BMX freestyle (motocross stunt riders) will compete for gold medals. Guests at the adjacent Crillon Hotel, the ne plus ultra of Paris luxury, may not be amused.\nOf course, central Paris is not all of Paris. Much of the Games will take place in Seine-Saint-Denis, a densely populated neighbourhood north of the city blighted by poverty, crime and the faltering integration of mainly North African immigrants, deprived of decent schools and opportunity.\nIt is also a vibrant melting pot and a testament to France’s growing diversity. The Olympic Village will be housed there, and a new 5,000-seat aquatics centre. A clean river and a revitalised Seine-Saint-Denis integrated into a “Grand Paris” are two of the core aspirations of the Games.\nThey are noble ambitions, but in France, seeing is believing.\nA poll last week by IFOP, a market-research group, found that 36 per cent of French people were still indifferent to the Games and 27 per cent anxious about them. That may well change once it all begins.\nThe Olympics will usher an expected 11.3 million visitors through the history of France, to the Palace of Versailles for equestrian events amid the urns and statuary and formal symmetry of the Gardens, where French royals once disported themselves before being decapitated in the Revolution of 1789.", "url": "https://www.straitstimes.com/sport/a-city-of-light-and-shadows-is-redrawn-for-the-olympics"}