{"authors": [], "date_download": "2024-10-12 14:03:45", "date_modify": "2024-10-12 14:03:45", "date_publish": "2024-04-13 23:06:28", "description": "He will face Norwegian Casper Ruud, who eliminated Serbian top seed Novak Djokovic, in the title decider on April 14. Read more at straitstimes.com.", "filename": "sport_tennis_stefanos-tsitsipas-knocks-out-jannik-sinner-to-reach-monte-carlo-final_1728741825.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/13/2024-04-13T142223Z1707099470UP1EK4D13XADORTRMADP3TENNIS-MONTECARLO.JPG?VersionId=Tg.azCR1C7fJY5mXYOxIZ1PTJyPteDVu", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_stefanos-tsitsipas-knocks-out-jannik-sinner-to-reach-monte-carlo-final_1728741825.html", "title": "Stefanos Tsitsipas knocks out Jannik Sinner to reach Monte Carlo Masters final", "title_page": "Stefanos Tsitsipas knocks out Jannik Sinner to reach Monte Carlo Masters final | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MONTE CARLO – Two-time Monte Carlo Masters champion Stefanos Tsitsipas believes he is playing tennis at its “highest level”, after he stunned second seed Jannik Sinner 6-4, 3-6, 6-4 on April 13 to advance to the final.\nThe 25-year-old Greek, who won the title in 2021 and 2022, kept his cool after a near-flawless display in the opening set to stop Sinner from producing a stirring comeback after the Italian roared back to take a 3-0 lead in the second set.\nSinner continued to build momentum after levelling things up and raced to a 4-3 lead in the decider before a right leg injury forced him to take a medical timeout.\nThe 22-year-old continued the match but proved no match for Tsitsipas, who reasserted himself to win three games in a row and clinch the match.\n“It was tennis at its highest level that I have been able to play,” said the Greek.\n“Jannik was an extremely difficult opponent and it can be seen throughout the year so far. He has been very consistent and I could see that throughout today with his game.\n“He is one of the toughest opponents I have faced so far and to find ways when there weren’t that many, I am proud of that.\n“He gave me a very difficult game and (the) way I overcame it is true excellence.”\nSinner had been in red-hot form this season, having won the Australian, Rotterdam and Miami Open, with his only loss in 23 matches coming against two-time Grand Slam champion Carlos Alcaraz in the Indian Wells semi-finals in March.\nFor Tsitsipas, having come into the contest with an 11-6 win-loss record for 2024, the win against Sinner ensured that he returned to the top 10 after dropping out for the first time since 2019 earlier in 2024.\nHe also now leads Sinner 6-3 in the duo’s head-to-head record. His latest victory was his first against a top-three opponent since 2022, when he beat Daniil Medvedev in Cincinnati.\n“It helps a lot knowing I have a win like this under my belt. Having a win like this and getting to the levels of tennis again brings a lot of satisfaction to me,” Tsitsipas added.\n“When there is a lot of work put in each day, these are the type of matches you are aiming for.”\nHe will now face world No. 10 Casper Ruud in the title decider on April 14 after the Norwegian defeated Serbian top seed Novak Djokovic 6-4, 1-6, 6-4 in the other semi-final. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/stefanos-tsitsipas-knocks-out-jannik-sinner-to-reach-monte-carlo-final"}