{"authors": [], "date_download": "2024-10-12 13:59:46", "date_modify": "2024-10-12 13:59:46", "date_publish": "2023-12-09 03:07:08", "description": "World Athletics sticks to ban on Russians and Belarusians competing in athletics events, amid Russia's invasion of Ukraine. Read more at straitstimes.com.", "filename": "sport_no-neutral-athletes-in-paris-2024-olympics-in-athletics-says-coe_1728741586.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/12/09/INDIA-OLYMPIC-SESSION-071951.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_no-neutral-athletes-in-paris-2024-olympics-in-athletics-says-coe_1728741586.html", "title": "‘No neutral athletes’ in track and field at Paris 2024 Olympics, says Coe", "title_page": "‘No neutral athletes’ in track and field at Paris 2024 Olympics, says Coe | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - World Athletics president Sebastian Coe said on Dec 8 that there would be no Russians or Belarusians competing as neutrals in the athletics at the Paris 2024 Olympic Games.\n“You may well see some neutral athletes from Russia and Belarus in Paris, it just won’t be in athletics,” Coe told a press conference at the World Athletics Council meeting in Monaco.\n“The position that our sport took and has consistently taken is unchanged.\n“It’s a settled position. It’s a position the (World Athletics) council took, it’s one endorsed by the executive board and on two separate global occasions it’s been endorsed almost unanimously by the athletics family.”\nWorld Athletics originally excluded competitors, coaches and officials from Russia and Belarus from its events as early as March 2022, shortly after the Russian invasion of Ukraine. Belarus is a supporter of Russia’s invasion of its neighbour.\nThe International Olympic Committee, however, opened the door earlier on Dec 8 to Russian and Belarusian athletes being able to compete in Paris as neutrals, outside of team events and as long as they did not actively support the war on Ukraine.\nCoe, however, said the IOC’s decision “points to the primacy of international federations” to make their own judgement.\n“It’s the pyramid,” he said.\n“The primacy of the eligibility and the selection, therefore, of the athletes sits with the international federations.\n“We have a fixed position. That position hasn’t altered.\n“I think it’s right that international federations should make the judgements that they feel are in the best interest of their sport. And that’s what our council has done.\n“Ours is a settled decision. We have made the judgement there will be no neutral athletes.” AFP", "url": "https://www.straitstimes.com/sport/no-neutral-athletes-in-paris-2024-olympics-in-athletics-says-coe"}