{"authors": [], "date_download": "2024-10-12 13:42:12", "date_modify": "2024-10-12 13:42:12", "date_publish": "2024-07-02 01:24:38", "description": "LEIPZIG, Germany - Austria surprisingly topped their Euro 2024 group to earn a round of 16 game with Turkey in Leipzig, the city where Ralf Rangnick spent almost a decade of his career, and that is more like destiny than chance, the manager said on Monday. Read more at straitstimes.com.", "filename": "sport_football_destiny-calls-for-rangnicks-austria-against-turkey-in-leipzig_1728740532.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/02/LYNXMPEK600ZM-1.jpg?VersionId=35FQIpWh1u.7w3bFJByOhC_wFa1AbIgV", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_destiny-calls-for-rangnicks-austria-against-turkey-in-leipzig_1728740532.html", "title": "Destiny calls for Rangnick's Austria against Turkey in Leipzig", "title_page": "Destiny calls for Rangnick's Austria against Turkey in Leipzig | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LEIPZIG, Germany - Austria surprisingly topped their Euro 2024 group to earn a round of 16 game with Turkey in Leipzig, the city where Ralf Rangnick spent almost a decade of his career, and that is more like destiny than chance, the manager said on Monday.\nRangnick's side topped Group D which contained France, the Netherlands and Poland, and their reward is Tuesday's tie which can take Austria into their first Euros quarter-final.\nThe game is at the home of RB Leipzig, where Rangnick spent nine years as sporting director and manager in two spells, and this unexpected return is something he finds hard to believe.\n\"I believe that if somebody would have forecast in the group phase that we basically proceed into the round of 16 and play in Leipzig then I would have said, 'well, you are very optimistic',\" Rangnick said.\n\"But it's amazing that we've made it this far, and not a coincidence that we play in this stadium tomorrow. I can remember when in 2012 I started here, well that was 12 years ago, and I'm more than happy to be here tomorrow.\n\"I also hope that many Austrian fans and also RB Leipzig fans will support us tomorrow.\"\nAt the press conference, Rangnick was accompanied by Christoph Baumgartner and Nicolas Seiwald, current RB Leipzig players, who also see Austria playing there as an advantage.\n\"It's something special when you walk inside the stadium and just feel at home because you've played most matches in this stadium during the season and you've had amazing experiences and moments in the stadium,\" Baumgartner said.\nHis Austria and RB team mate was in complete agreement.\n\"I feel so well and comfortable when entering the stadium,\" Seiwald said. \"And I think it's just an advantage to be able to play in Leipzig here. We look forward to tomorrow and it'll be just an amazing game.\n\"I hope that also the neutral fans will be on our side because I think they have a better relation to us than to the Turkish team.\"\nTurkey's games so far have been highly charged and in their last game with Czech Republic they collected 11 yellow cards while their opponents went down to 10 men early on, something that could come into play in this match.\n\"Of course, we know that Turkey is a team that will also try to bring emotion into the game,\" Rangnick said.\n\"We also need the highest possible energy level. To put it a bit vividly, we also need hot hearts on the pitch. But we still need a cool head in every situation.\" REUTERS", "url": "https://www.straitstimes.com/sport/football/destiny-calls-for-rangnicks-austria-against-turkey-in-leipzig"}