{"authors": [], "date_download": "2024-10-12 14:00:17", "date_modify": "2024-10-12 14:00:17", "date_publish": "2024-08-27 12:13:13", "description": "NEW YORK - Novak Djokovic's bid for a record 25th Grand Slam title kicked off on Monday with a rusty 6-2 6-2 6-4 win over qualifier Radu Albot in the U.S. Open first round as the defending champion returned to the court after his Olympic triumph. Read more at straitstimes.com.", "filename": "sport_tennis_rusty-djokovic-kicks-off-grand-slam-record-bid-with-albot-thrashing_1728741617.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/27/LYNXMPEK7Q03S-1.jpg?VersionId=415O3oZRnHOhW0UZ.I0TQwKvDVkWQMIC", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_rusty-djokovic-kicks-off-grand-slam-record-bid-with-albot-thrashing_1728741617.html", "title": "Rusty Djokovic kicks off Grand Slam record bid with Albot thrashing", "title_page": "Rusty Djokovic kicks off Grand Slam record bid with Albot thrashing | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "NEW YORK - Novak Djokovic's bid for a record 25th Grand Slam title kicked off on Monday with a rusty 6-2 6-2 6-4 win over qualifier Radu Albot in the U.S. Open first round as the defending champion returned to the court after his Olympic triumph.\nThree weeks after winning the singles title at the Paris Games, Djokovic toted his rackets and gear in a pair of gold-coloured bags onto centre court where the Arthur Ashe Stadium crowd gave him a hero's welcome.\nBut the Serb's golden touch was decidedly lacking in the late night match as he struggled with serve and racked up nearly twice as many unforced errors as winners.\nFor all that, he had more than enough weapons to handle Moldovan Albot in their first tour clash and claim a record 78th win at Arthur Ashe under a closed roof.\n\"I was not aware of it, to be honest with you,\" Djokovic said of the centre court milestone.\n\"It's definitely the loudest stadium we have in the history of our sport. The night sessions are the best in the world here.\"\nWhile having never played Albot before, Djokovic said he had done his homework on the 34-year-old who beat both his younger brothers Marko and Djordje during their playing days.\n\"They both lost to him so hopefully I can avenge my brothers tonight,\" he told ESPN commentator Brad Gilbert with a laugh before taking the court.\nDjokovic duly avenged the family name in three clunky sets but he will hope for better from his game as he looks to move past Margaret Court on the all-time Grand Slam winners' list.\nWith 10 double-faults, his serve was wild by his usual standards, and he winced throughout the night as 40 unforced errors piled up.\nHis coach Nenad Zimonjic was an animated presence, barking instructions in Serbian at the wayward champion, who could convert only six out of 16 break points.\nThough Djokovic was well off his best, Albot was unable to make the world number two pay.\nAfter bright starts in the first two sets, he crumbled on serve in each of them before making a better game of the third.\nIn the twilight of a record-smashing career, Djokovic is eyeing several milestones in New York, including a fifth title at Flushing Meadows to match the professional era record held by Pete Sampras, Jimmy Connors and Roger Federer.\nHe also hopes to become the first back-to-back winner in the men's singles since Federer's run of five successive titles from 2004-08. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/rusty-djokovic-kicks-off-grand-slam-record-bid-with-albot-thrashing"}