{"authors": [], "date_download": "2024-10-12 13:41:41", "date_modify": "2024-10-12 13:41:41", "date_publish": "2024-04-15 20:16:58", "description": "Everton have lodged an appeal against a two-point deduction in relation to their breach of the Premier League's Profit & Sustainability Rules (PSR), the club said on Monday. Read more at straitstimes.com.", "filename": "sport_football_everton-lodge-appeal-against-two-point-deduction-report_1728740501.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/15/LYNXNPEK3E0EB-1.jpg?VersionId=gjfCSsgcJZELo8q5yBoKhLkmfVudTNww", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_everton-lodge-appeal-against-two-point-deduction-report_1728740501.html", "title": "Everton lodge appeal against two-point deduction", "title_page": "Everton lodge appeal against two-point deduction | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "Everton have lodged an appeal against a two-point deduction in relation to their breach of the Premier League's Profit & Sustainability Rules (PSR), the club said on Monday.\nThe Premier League said the appeal will be heard urgently with a decision before the end of the season.\nEverton were charged in January for violations of the Premier League's PSR in their financial records for a period beginning in 2019-20 and ending in 2022-23.\nThey were then docked two points by the Premier League on April 8 -- their second points deduction this season -- which meant they dropped to 16th place in the standings.\n\"Everton can confirm that it has formally lodged its appeal of the two-point deduction imposed last week by a Premier League commission following a breach of the Profit and Sustainability rules in FY23,\" the club said in a statement.\nThe Premier League added: \"For clarity and certainty for all clubs and fans, the Premier League will be seeking to have the appeal resolved urgently with the outcome confirmed in advance of Sunday 19 May, the last day of this season.\"\nEverton were also deducted 10 points in November after admitting a breach of PSR for the assessment period ending with the 2021-22 season, although that was reduced to six on appeal. REUTERS", "url": "https://www.straitstimes.com/sport/football/everton-lodge-appeal-against-two-point-deduction-report"}