{"authors": [], "date_download": "2024-10-12 14:11:36", "date_modify": "2024-10-12 14:11:36", "date_publish": "2024-08-01 21:39:38", "description": "HONG KONG/PARIS - Fresh off the plane from Paris on Thursday, Hong Kong's newly crowned Olympic fencing champion Vivian Kong was still immersed in her victory. Read more at straitstimes.com.", "filename": "sport_fencing-champion-kong-still-in-a-daze-on-hong-kong-return_1728742296.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/LYNXMPEK701UK-1.jpg?VersionId=SlS0WFveJUWiUacxPMMB7OVikMPOAfOr", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_fencing-champion-kong-still-in-a-daze-on-hong-kong-return_1728742296.html", "title": "Fencing-Champion Kong still in a daze on Hong Kong return", "title_page": "Fencing-Champion Kong still in a daze on Hong Kong return | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "HONG KONG/PARIS - Fresh off the plane from Paris on Thursday, Hong Kong's newly crowned Olympic fencing champion Vivian Kong was still immersed in her victory.\nThe 30-year-old won her first Olympic gold in a hard-earned epee final against local favourite Auriane Mallo-Breton.\n\"I'm still trying to process what just happened,\" a smiling Kong told reporters in the Hong Kong International Airport on Thursday. \"I feel like I'm still in a dream, so I'll wake up first.\"\nKong, who recovered from a knee injury sustained only a month ago, rallied from 7-1 down to end her opponent’s hopes in front of a raucous crowd including French President Emmanuel Macron.\n\"I just didn’t want to lose so badly. I don’t think being at such a beautiful venue with the palace, with the purple piece, we've never fenced on the purple piece before, I wanted to fence my all, I didn’t want to have regrets like that,\" she said.\nKong started fencing at the age of 11 after trying a number of sports including athletics and taekwondo.\nShe made her Olympic debut in the Rio Games in 2016, becoming Hong Kong's first fencer to win a contest at the Games when she beat 2009 world champion, Russia's Lyubov Shutova.\nIn Tokyo, Kong finished fifth in the individual epee event and seventh in the team event.\nKong has charmed sports fans on social media with her friendly demeanour and range of interests outside fencing.\nShe obtained a bachelor's degree in international relations from Stanford University and is currently a law student at the Chinese University of Hong Kong.\nTalking to reporters in Cantonese, English and Mandarin, Kong said she would use her prize money to buy gifts for her team, coach and roommate.\nShe is also going to set up charitable fund or social enterprise to help children.\n\"I really hope that there are more opportunities for everyone to be exposed to sports with a high barrier for entry. Even if they don't like fencing, there is gotta be one sport that kids will like. I hope everyone will have the opportunity to find their favourite sport,\" Kong said while blowing kisses to the crowd waving at her in the airport.\nNext up for Kong is a skiing trip.\n\"I was always afraid of hurting my knees, but now I can think about maybe going for a little skiing,\" she said. REUTERS", "url": "https://www.straitstimes.com/sport/fencing-champion-kong-still-in-a-daze-on-hong-kong-return"}