{"authors": ["Nicole Chia"], "date_download": "2024-10-12 14:21:34", "date_modify": "2024-10-12 14:21:34", "date_publish": "2020-01-08 17:07:54", "description": "Nicole Chia Read more at straitstimes.com.", "filename": "sport_golf_golf-singapore-open-voted-best-event-on-asian-tour_1728742894.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/01/08/yq-smbc2-07012020.jpg?VersionId=xi9wHtGV1C698.4VXqaX08g.qwD1jQ8F", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_golf_golf-singapore-open-voted-best-event-on-asian-tour_1728742894.html", "title": "Golf: Singapore Open voted best event on Asian Tour", "title_page": "Golf: Singapore Open voted best event on Asian Tour | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "The 2019 SMBC Singapore Open was voted the Best Event on Tour at the Asian Tour Awards night in Hong Kong on Tuesday (Jan 7).\nIt is the second time the tournament was awarded this accolade, after it received the same award in 2017.\nThe Sentosa Golf Club's Serapong Course, where the tournament was held, was also named Best Golf Course on Tour.\nPatrick Feizal Joyce, Lagardere Sports' senior vice president for Golf, Asia, said: \"This is a tremendous honour for everyone involved as the players vote for these awards and we are extremely grateful.\n\"It is especially pleasing to win this for the second time and we congratulate our friends at Sentosa Golf Club for earning the Best Golf Course Award.\"\nThe SMBC Singapore Open starts next week from Jan 16 to 19.\nAmong those confirmed for the tournament are defending champion Jazz Janewattananond of Thailand and reigning Olympic champion Justin Rose of England.\nSwede Henrik Stenson and American Matt Kuchar, the 2016 Olympic silver and bronze medallists respectively, will feature as well.", "url": "https://www.straitstimes.com/sport/golf/golf-singapore-open-voted-best-event-on-asian-tour"}