{"authors": ["David Lee"], "date_download": "2024-10-12 13:43:22", "date_modify": "2024-10-12 13:43:22", "date_publish": "2023-11-29 20:24:31", "description": "Other big winners include sailors Ryan Lo, Maximilian Maeder as well as wushu exponent Jowen Lim. Read more at straitstimes.com.", "filename": "sport_shanti-pereira-collects-315000-at-map-awards-for-successful-asian-and-sea-games-campaigns_1728740602.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/11/29/2023112926680242bum2737-01.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_shanti-pereira-collects-315000-at-map-awards-for-successful-asian-and-sea-games-campaigns_1728740602.html", "title": "Shanti Pereira collects $315,000 at MAP Awards for successful Asian and SEA Games campaigns", "title_page": "Shanti Pereira collects $315,000 at MAP Awards for successful Asian and SEA Games campaigns | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE – After a hectic year in the fast lane, Singapore sprint queen Shanti Pereira admitted it was “kind of strange” to slow down and pack for travelling without her spikes to go for a one-week holiday in South Korea to “just eat and shop” in October after her Asian Games exploits.\nShe said: “It was a nice change to be able to do that and wind down after such a crazy and incredible year.”\nBut the country’s fastest woman just cannot stand still. She took a three-week break but has already resumed training for a month as she eyes more national records when she resumes her season in April, before taking on the July 26-Aug 11 Paris Olympics.\nPereira, 27, said: “The goal is always to go faster and find the little places to improve as much as we can and cutting down the time.”\nHer sterling Asian and SEA Games campaigns in 2023 also made her the big winner at the Major Games Award Programme (MAP) awards presentation and appreciation dinner at Timbre+ One North on Nov 29.\nShe collected $315,000 for her Asiad gold (women’s 200m) and silver (100m) plus two SEA Games titles.\nShe noted: “Having this extra prize launches us to a new level in our careers. Any extra support is amazing help for athletes in the lead-up to major competitions.”\nIn total, the Singapore National Olympic Council (SNOC) and Tote Board rewarded 121 medallists from both Games with almost $2.3 million. Athletes are required to donate between 20 and 50 per cent of MAP Awards prize money back to their national sports association for future training and development.\nThe Republic’s 554-strong contingent at the Phnom Penh SEA Games in May returned with 51 golds, 43 silvers and 64 bronzes while the team that competed at the Hangzhou Asiad from Sept 23-Oct 8 managed three gold, six silver and seven bronze medals.\nFor wrestler Timothy Loh, who finally won a SEA Games gold with his victory in the men’s freestyle 125kg in Cambodia, the $10,000 reward was much appreciated.\nOn top of training and competitions, the 31-year-old coaches wrestling, judo and Brazilian jiu-jitsu, while also operating a pop-up food business. Loh, who is trying to qualify for the Paris Olympics, said: “It’s crazy, but it’s nice because these are things I love to do – I love to coach, I love to cook, I love to compete and I love to train.\n“It is tough, don’t get me wrong, but doing something that you actually enjoy makes it easier.\n“These are the first MAP Awards for wrestling, and it shows that we all can have something to achieve as we push and work towards bigger things. Most of the money will go into training camps towards the bigger goal of qualifying for the Olympics.”\nSNOC acting president Jessie Phua thanked the sports fraternity, families, Government and various stakeholders for their support of the athletes.\nShe said: “At these Games, we witnessed our athletes’ tenacity to stand among the region’s best and their determination to earn a spot on the podium.\n“We hope these experiences have expanded the desire and hunger to chase loftier dreams and reach greater heights.”\nTop earners\nShanti Pereira, athletics, $315,000\nAsian Games gold (women’s 200m), silver (100m), two SEA Games golds (100m, 200m)\nRyan Lo, sailing, $210,000\nAsian Games gold (men’s ILCA 7), SEA Games gold (ILCA 7)\nMaximilian Maeder, sailing, $200,000\nAsian Games gold (men’s Formula Kite)\nIsaac Goh, sailing, $110,000\nAsian Games silver (boys’ ILCA 4), SEA Games gold (ILCA 4)", "url": "https://www.straitstimes.com/sport/shanti-pereira-collects-315000-at-map-awards-for-successful-asian-and-sea-games-campaigns"}