{"authors": [], "date_download": "2024-10-12 14:00:38", "date_modify": "2024-10-12 14:00:38", "date_publish": "2024-08-03 23:05:31", "description": "PARIS - History repeated itself for China's defending champion Chen Meng when she beat teammate Sun Yingsha 4-2 to win the women's singles table tennis gold medal at the Paris Olympics on Saturday, just as she had done at the Tokyo Games. Read more at straitstimes.com.", "filename": "sport_tennis_table-tennis-chinas-chen-beats-teammate-sun-again-to-defend-womens-singles-title_1728741638.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/03/LYNXMPEK7205Z-1.jpg?VersionId=NYZ12QsU6HEzsVvvOdzCw6fuSEUYQ8GP", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_table-tennis-chinas-chen-beats-teammate-sun-again-to-defend-womens-singles-title_1728741638.html", "title": "Table tennis-China's Chen beats teammate Sun again to retain women's singles title", "title_page": "Table tennis-China's Chen beats teammate Sun again to retain women's singles title | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - History repeated itself for China's defending champion Chen Meng when she beat teammate Sun Yingsha 4-2 to win the women's singles table tennis gold medal at the Paris Olympics on Saturday, just as she had done at the Tokyo Games.\nThis second triumph was even sweeter for fourth-ranked Chen, who called this win over world number one Sun a surprise, making her the third female table tennis player to win gold medals in singles at two consecutive Olympics.\n\"This gold medal feels more valuable. In Tokyo, I was at the peak of my career, but in the past few years I've suffered a lot of losses and injuries,\" said Chen.\nThe 30-year-old added that she felt at a significant disadvantage before the match, given her losing track record against Sun, and attributed the win to her mindset.\nSun comfortably won the opening game 11-4. After Chen claimed the next two 11-7 11-4, Sun, who had not lost a game at the Olympics until then, said her confidence started to shake after she levelled the match at 2-2 by taking the fourth 11-9.\nChen remained calm under pressure, especially when she fell three points behind at the start of the sixth game, which she took 11-9 before finishing off the contest 11-6.\nFor Chen, the quick turnover in China's dominant team left her wondering if she will be back to defend her title.\n\"I don't know if this is going to be my last Olympics, so I want to cherish the opportunity as best as I can,\" she added.\nThe 23-year-old Sun, who was consoled by Chen with a hug after the loss, said she will fight for gold again in four years' time in Los Angeles.\nAt the press conference, Sun also praised Japan's Hina Hayata, who earlier won the bronze medal match by beating South Korea's Shin Yu-bin 4-2 after overcoming injury for a hard-fought victory which left her in tears.\nHer performance secured Japan's second medal in the event, following Mima Ito's bronze in Tokyo three years ago.\nHaving injured her left wrist this week, Hayata could not even use a hair dryer and thought it was a mission impossible to play. After treatment, she adjusted her style to focus on using her forehand instead of backhand to avoid further pain.\n\"After this injury, I couldn't use my left hand at all. Being able to play and win a bronze medal despite that situation makes me feel incredibly grateful to everyone,\" said Hayata.\nChina's gold and silver sweep extended their dominance in women's singles, winning all 10 of the golds ever awarded in the event. Two Grand Slam champions, Zhang Yining and Ding Ning, were present in the stands to watch the matches on Saturday.\nA Grand Slam is Olympics, World and World Cup titles. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/table-tennis-chinas-chen-beats-teammate-sun-again-to-defend-womens-singles-title"}