{"authors": [], "date_download": "2024-10-12 14:17:06", "date_modify": "2024-10-12 14:17:06", "date_publish": "2023-10-05 13:33:40", "description": "He needs to score only three points to triumph again and could achieve that, or better, in Saturday’s sprint race. Read more at straitstimes.com.", "filename": "sport_formula-one_max-verstappen-poised-for-third-formula-one-title-with-rare-saturday-title-triumph_1728742626.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/05/TOPSHOTS-TOPSHOT-AUTO-PRIX-F1-JPN-RACE-PODIUM-140406.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_max-verstappen-poised-for-third-formula-one-title-with-rare-saturday-title-triumph_1728742626.html", "title": "Max Verstappen poised for third Formula One motor racing crown with rare Saturday title triumph", "title_page": "Max Verstappen poised for third Formula One motor racing crown with rare Saturday title triumph | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA – Runaway Formula One leader Max Verstappen is poised to win a third consecutive drivers’ world title at the Qatar Grand Prix this weekend and may even become the sport’s first “Saturday champion” in four decades.\nThe 26-year-old Dutchman, winner of 13 races this season, leads his Red Bull teammate and only remaining championship rival Sergio Perez by 177 points after 16 rounds of the 22-race season.\nThat luxurious advantage means he needs to score only three points to triumph again and could achieve that, or better, in Saturday’s sprint race at the Lusail International Circuit.\nThe winner receives eight points, reducing by a point per place.\nRed Bull have won all previous three sprints this campaign – Perez taking one and Verstappen, two.\nIt is a record that makes it likely that the newly crowned constructors’ champions, who clinched that honour for a second successive year at September’s Japanese Grand Prix, will be favourites again.\n“It feels good to be heading into Qatar with the constructors’ championship secured,” said a relaxed Verstappen.\n“The track in Qatar is really fun to drive but it is going to be a tough weekend for all of us as it is so hot.\n“The temperatures will make it interesting, especially as we have a sprint race this weekend, so we need to learn as much as we can from Friday practice ahead of Saturday.”\nRegarding his individual triumph, he added: “The drivers’ title can be won on Saturday, so that is our main aim and, hopefully, it will be a weekend to remember.”\nIf Verstappen clinches the title in the sprint, he will be the first Saturday champion since Nelson Piquet, the Brazilian father of his girlfriend Kelly, won the second of his three titles 40 years ago at the 1983 South African Grand Prix.\nFour other drivers have won the title on a Saturday – Juan Manuel Fangio (1955), Jack Brabham (1959), Graham Hill (1962) and Keke Rosberg (1982).\nAfter his dominant race victory in Japan, the Dutchman will be expected to continue the form that carried him to 10 straight wins before he and Red Bull were beaten in Singapore in mid-September.\nHowever, rivals Ferrari, Mercedes, McLaren and Aston Martin will be keen to make life difficult.\nMercedes’ seven-time world champion Lewis Hamilton, in particular, could shine at the resurfaced circuit, where he won the only previous Qatar Grand Prix two years ago in a late-season burst of form that saw him almost succeed in securing an eighth title.\nMeanwhile, Australian Liam Lawson, who impressed in Japan where he scored two points, will replace compatriot Daniel Ricciardo at AlphaTauri for the fifth consecutive race as the former Red Bull driver continues to recover from injury. AFP", "url": "https://www.straitstimes.com/sport/formula-one/max-verstappen-poised-for-third-formula-one-title-with-rare-saturday-title-triumph"}