{"authors": [], "date_download": "2024-10-12 13:40:40", "date_modify": "2024-10-12 13:40:40", "date_publish": "2024-04-26 05:08:12", "description": "Phil Foden strikes twice in a ruthless 4-0 victory for imperious City. Read more at straitstimes.com.", "filename": "sport_football_man-city-humble-brighton-to-keep-pressure-on-arsenal_1728740440.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/04/26/11301074.jpg?VersionId=boSBp_ksVniEiXfxmn_LfTA.sPWtcDGw", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_man-city-humble-brighton-to-keep-pressure-on-arsenal_1728740440.html", "title": "Manchester City crush Brighton to close gap on EPL leaders Arsenal in title race", "title_page": "Manchester City crush Brighton to close gap on EPL leaders Arsenal in title race | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Manchester City manager Pep Guardiola believes it is still a three-horse race in the English Premier League, despite his team being in the driver’s seat after their 4-0 thrashing of Brighton & Hove Albion on April 25.\nPhil Foden struck twice at the Amex as City stepped up their bid for an unprecedented fourth league crown in a row.\nA day after Liverpool’s title challenge suffered a blow with a 2-0 loss at Everton, Guardiola’s men kept up the pressure on leaders Arsenal with a dominant display that left them one point behind the Gunners (77) with a game in hand.\nLiverpool are on 74 points and like Arsenal, have played 34 games.\n“The statement is three points. There are five games left, we know the margins are so tight. We have to win every one. Each game we are closer,” Guardiola told Sky Sports.\nHe added that it remains very much a three-team race, even though City will be crowned champions if they win their last five matches.\n“What happened to Liverpool, two defeats in a row, it can happen to Arsenal, it can happen to us. What is important is that still we are there. There is a lot of games to play,” he said.\nKevin de Bruyne’s superb diving header put City, missing injured top scorer Erling Haaland, ahead in the 17th minute.\n“It doesn’t happen too much, does it? The only way I could reach it was jumping to the ball, and it goes in like a little lob, but it’s obviously not something I’m really good at,” the Belgian playmaker said, after netting his first headed goal in the Premier League.\nFoden scored his first with a deflected free kick before Brighton defensive errors allowed Bernardo Silva to win the ball and set up the England attacker to sweep a shot into the bottom corner before half-time.\n“With Kev’s first goal and a bit lucky with my second goal, it settled us a little bit and we grew into the game. The first half was frightening with the way we attacked,” said Foden, who became only the third player to score 50 top-flight goals under Guardiola aged 23 or younger, after Lionel Messi and Haaland.\nJulian Alvarez completed the rout midway through the second half and Brighton, who remained 11th in the table, never looked capable of launching a fightback.", "url": "https://www.straitstimes.com/sport/football/man-city-humble-brighton-to-keep-pressure-on-arsenal"}