{"authors": [], "date_download": "2024-10-12 13:43:38", "date_modify": "2024-10-12 13:43:38", "date_publish": "2024-07-09 15:32:02", "description": "Their Euro 2024 clash in Dortmund will be just the second competitive game between the sides this century. Read more at straitstimes.com.", "filename": "sport_football_from-ronald-koeman-s-free-kick-to-euro-96-five-netherlands-v-england-clashes_1728740618.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/07/09/hznedeng0907.jpg?VersionId=Ql28kde7r4U0wWMNAVgRiRR3Qxguc5Le", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_from-ronald-koeman-s-free-kick-to-euro-96-five-netherlands-v-england-clashes_1728740618.html", "title": "From Ronald Koeman’s free kick to Euro 96: Five Netherlands v England clashes", "title_page": "From Ronald Koeman’s free kick to Euro 96: Five Netherlands v England clashes | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DORTMUND – The Netherlands and England meet in the last four of Euro 2024 on July 10 with both teams eyeing a place in the July 14 final in Berlin.\nThere was a time when the two nations met regularly on the international stage, but the match in Dortmund will be just the second competitive game between the sides this century.\nHere is a look at their most notable encounters:\nVan Basten hat-trick\nThe 1988 European Championship remains the only major international tournament that the Netherlands have won, and will always be remembered for Marco van Basten’s stunning goal in the final against the Soviet Union.\nIt also remains a low point for England, the only time in which they have gone to a major tournament and lost every game.\nBoth sides lost their opening match before they clashed in Dusseldorf in the group phase, and the Dutch came out on top thanks to a van Basten hat-trick.\nVan Basten’s opener for the Netherlands was cancelled out by a Bryan Robson equaliser, but two goals in four second-half minutes sealed the 3-1 win.\nDraw at Italia 90\nThe two teams were again drawn in the same group at the 1990 World Cup in Italy, and many of the players involved in 1988 again featured in this meeting in Cagliari. Among them was current Dutch boss Ronald Koeman.\nThe sides had each drawn their opening match, with England being held by Ireland and the Netherlands by Egypt.\nThis time England kept van Basten quiet in a 0-0 draw, and it was England who would top the group on the way to reaching the semi-finals. The Dutch, meanwhile, were beaten by West Germany in the last 16.\nEngland miss out on USA 94\nEngland have failed to qualify for just one World Cup since the 1970s, and it was the Netherlands who denied them a place in 1994.\nGraham Taylor’s England had a poor campaign in 1993, taking just one point from two games against Norway, who topped the group. They squandered a two-goal lead at Wembley to draw 2-2 with the Dutch, but when they went to Rotterdam for the return fixture – their penultimate game in the group – England still had qualification in their own hands as they were above the Dutch.\nWith Paul Gascoigne suspended, England fell behind to a free kick just after the hour mark by Koeman – who the visitors felt should have been sent off earlier on – before Dennis Bergkamp sealed a 2-0 win.\nShearer-Sheringham double\nThe teams met again in the group stage at Euro 96. Both teams had taken four points from their first two matches before clashing at Wembley, where Alan Shearer opened the scoring with a penalty and added another goal in the second half. Teddy Sheringham also grabbed a brace.\nPatrick Kluivert’s late goal for the Dutch made the final score 4-1 as England won the group and the Netherlands squeezed through in second place ahead of Scotland.\nThe Dutch lost on penalties to France in the last eight, while England were beaten in a shoot-out in the semi-finals by Germany.\nCurrent England manager Gareth Southgate missed their sixth penalty, the first sudden-death effort.", "url": "https://www.straitstimes.com/sport/football/from-ronald-koeman-s-free-kick-to-euro-96-five-netherlands-v-england-clashes"}