{"authors": ["Kimberly Kwek"], "date_download": "2024-10-12 13:41:37", "date_modify": "2024-10-12 13:41:37", "date_publish": "2024-08-07 23:13:31", "description": "The top two in the current standings have qualified directly for the Aug 8 final. Read more at straitstimes.com.", "filename": "sport_s-pore-kitefoiler-maximilian-maeder-qualifies-for-final-bid-for-olympic-medal-remains-on-track_1728740497.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/07/2024080797084856img2721.jpg?VersionId=88mhEVnhMT21fX8mk_pRBp3uMDfYEQ5_", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_s-pore-kitefoiler-maximilian-maeder-qualifies-for-final-bid-for-olympic-medal-remains-on-track_1728740497.html", "title": "Singapore kitefoiler Maximilian Maeder qualifies for final, Olympic medal bid remains on track", "title_page": "Singapore kitefoiler Maximilian Maeder qualifies for final, Olympic medal bid remains on track | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "MARSEILLE – Singaporean kitefoiler Maximilian Maeder has been in dominant form throughout the 2024 season, but has faced his toughest challenge on the biggest stage – at the Paris Olympics.\nHe admitted that the Olympic regatta has been his most difficult event this year, as he stands on the cusp of winning a medal at the quadrennial Games on Aug 8.\nA day earlier, he had secured his spot in the men’s final as one of the top two kitefoilers at the end of the opening series.\nThe 17-year-old was second on 15 net points, with Slovenia’s Toni Vodisek leading the fleet of 20 sailors with 12 net points.\nThe two-time world champion said: “The margins are so small, the thrill of every race you compete in not knowing how it will go. You prepare to perfection, you try your best, you execute in a rational manner and you give all that you can and then you get a relatively mediocre result.\n“This hasn’t happened before, at least in my experience, so it goes to show the extreme high level that is here and also my hat’s off to all my competitors, they’ve made it a thrill and an exciting event.”\nThe Olympic kitefoiling competition continued to be affected by weak winds on Aug 7, with racing taking place briefly on the fourth day of the event, before it was called off due to light winds. Out of the 16 races that were scheduled for the opening series, only seven took place.\nAccording to the official Olympics website, the two other final berths will be decided by the semi-finals on Aug 8, which will involve the third to 10th-ranked kitefoilers.\nThey will be split into two groups and the winner of each semi-final will complete the final four.\nAs the leader, Vodisek enters the final with two match points, which means the 24-year-old needs just one victory under the first-to-three format to take the title.\nMaximilian, who carries over one match point after qualifying second, will need to win two races to clinch gold.", "url": "https://www.straitstimes.com/sport/s-pore-kitefoiler-maximilian-maeder-qualifies-for-final-bid-for-olympic-medal-remains-on-track"}