{"authors": [], "date_download": "2024-10-12 14:00:56", "date_modify": "2024-10-12 14:00:56", "date_publish": "2024-07-31 23:04:29", "description": "PARIS - The ability to multi-task is essential for any player with multiple medal ambitions in the Olympic tennis competition. Read more at straitstimes.com.", "filename": "sport_tennis_tennis-no-rest-for-multiple-medal-hunters-at-roland-garros_1728741656.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/01/LYNXMPEK6U14S-1.jpg?VersionId=QpKcDs0IGjpeDcHJS_wO2xKBNJMnxGu6", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_tennis-no-rest-for-multiple-medal-hunters-at-roland-garros_1728741656.html", "title": "Tennis-No rest for multiple medal hunters at Roland Garros", "title_page": "Tennis-No rest for multiple medal hunters at Roland Garros | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - The ability to multi-task is essential for any player with multiple medal ambitions in the Olympic tennis competition.\nThe Games are far removed from the world of Grand Slams where specialist singles players often steer clear of doubles while the world's best doubles teams are often not in singles draws and mid-tournament days off are normal.\nOn the fifth day of the Olympic tennis at a stifling, humid Roland Garros there was precious little rest for some players going the extra mile for their countries.\nWhile men's top seed Novak Djokovic could put his feet up after reaching the men's quarter-finals by beating Germany's Dominik Koepfer, others were handling a frantic schedule.\nAmerican Taylor Fritz's singles ambitions were ended by Italian Lorenzo Musetti but he had no time to feel sorry for himself because he was due back on court to partner Tommy Paul to victory over Dutch duo Robin Haase and Jean-Julien Rojer.\nFritz then teamed Coco Gauff for a mixed doubles quarter-final in the evening which they ended up losing to Canada's Felix Auger Aliassime and Gabriela Dabrowski.\n\"Luckily, the doubles is not the same physicality as singles,\" Fritz said.\nPaul warmed up for the doubles by reaching the singles quarter-finals with a win against France's Corentin Moutet -- celebrating by wielding an imaginary shovel.\n\"We've been digging all week,\" the ninth seed said, adding that the team camaraderie was a motivating factor.\n\"You come into the event knowing that it's going to be very different. Normal routines you throw out the window because maybe you're staying in to watch a teammate or maybe you have to play three matches in one day. It's different, but it's fun.\"\nFrench Open and Wimbledon champion Carlos Alcaraz was doubling up on Wednesday. After beating Roman Safiullin to reach the singles quarter-finals he was joining forces again with fellow Spaniard Rafa Nadal for a men's doubles quarter-final against Americans Rajeev Ram and Austin Krajicek.\nGauff, knocked out of the singles on Tuesday, was focusing on her medal possibilities in the doubles. As well as partnering Fritz on Wednesday she was also in women's doubles action alongside Jessica Pegula.\nSadly for the 20-year-old, she lost both.\nAnd the workload proved tough for team mate Danielle Collins too. After retiring at 4-1 down in the third set of her singles against top seed Iga Swiatek she then lost with Desirae Krawczyk in the doubles to Ukraine sisters Lyudmyla and Nadiia Kichenok.\n\"I nearly collapsed when I came off court, and I was on a medical table for three hours, having full-body convulsions and somehow played doubles,\" Collins said.\nCanada's Felix Auger-Aliassime also faced a hectic day as he beat Russian Daniil Medvedev before returning to face fellow workaholics Fritz and Gauff in a mixed doubles quarter-final with partner Gabriela Dabrowski, who herself was in earlier women's doubles action with Leylah Fernandez. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/tennis-no-rest-for-multiple-medal-hunters-at-roland-garros"}