{"authors": ["Nicole Chia"], "date_download": "2024-10-12 14:21:01", "date_modify": "2024-10-12 14:21:01", "date_publish": "2020-06-13 16:11:34", "description": "SINGAPORE - The business of governing sports in Singapore enters the virtual world this year as national sports associations (NSA) are preparing to move their annual general meetings (AGM) online as part of safe distancing guidelines. Read more at straitstimes.com.", "filename": "sport_national-sports-associations-in-singapore-prepare-to-take-annual-general-meetings-into-virtual_1728742861.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2020/06/13/rk_virtualmeetings_130620.jpg?VersionId=kt_ng5i3BDNn.YdOoWKpGNCe99Ez7OAW", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_national-sports-associations-in-singapore-prepare-to-take-annual-general-meetings-into-virtual_1728742861.html", "title": "National sports associations in Singapore prepare to take annual general meetings into virtual space", "title_page": "National sports associations in Singapore prepare to take annual general meetings into virtual space | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "SINGAPORE - The business of governing sports in Singapore enters the virtual world this year as national sports associations (NSA) are preparing to move their annual general meetings (AGM) online as part of safe distancing guidelines.\nAmong those that have postponed their AGMs are the governing bodies for netball, bowling, swimming and athletics, with the latter two also due to elect office-bearers this year.\nSingapore Swimming Association (SSA) president Lee Kok Choy told The Straits Times his organisation has not decided if its meeting will take place online yet, but said that it would \"definitely prepare all the processes needed for an electronic meeting\".\nSingapore Athletics (SA), whose constitution states its AGM has to be held by July 31, has postponed its meeting to Sept 25.\nIts executive director Malik Aljunied said: \"Due to the current restrictive circumstances, SA would need more time to settle internal matters, including amending the constitution to include electronic voting (which is) a requirement of an IPC (Institutions of a Public Character) organisation.\"\nA new law passed in April allows registered societies and companies to adopt alternative means of conducting AGMs, such as through video conferencing, or to postpone them, during the Republic's circuit breaker period.\nThe Commissioner of Charities (COC) and the Chartered Secretaries Institute of Singapore (CSIS) last month issued a guide for charities on the conduct of meetings amid Covid-19. The guide states electronic voting is allowed \"only if the society's constitution specifically allows this. Otherwise, voting must be done by proxy.\"\nThe chairman of the meeting, usually the society's president, will be the appointed proxy.\nThe guide also notes: \"Where voting is done by proxy, proxy votes must be voted as specified in all valid proxy forms. Charities are also advised to appoint an independent person to direct and supervise the count of votes cast through proxy, and maintain records of proxy forms submitted.\"\nThese arrangements apply to the period between March 27 and Sept 30.\nSA's Malik noted if the situation becomes viable and logistically tenable, the association will work towards the usual physical AGM - previous editions drew between 60 and 70 people - with all the necessary precautions and measures in place.\nLee pointed out should the SSA's AGM be an online one, affiliates would likely receive a month's notice instead of the 14 days' written notice as stated in its constitution, which stipulates that the AGM must take place by June 30.\nThis is to ensure smooth logistics and administration, he said, adding that a date would be fixed after the association, which has 37 ordinary members with voting rights, goes over its timelines.\nHe explained: \"Let's say we use Zoom as our chosen electronic platform. We'd have to test it for every affiliate to make sure their Zoom works and ensure that the security is there - we can't do that on the day itself.\"\nSingapore Bowling Federation's executive director Melvyn Fones, noting the guidelines for Phase 2 Safe Transition state that only small group gatherings of up to five persons are allowed, said: \"We have also informed our affiliates that our AGM will be conducted via Zoom on July 27.", "url": "https://www.straitstimes.com/sport/national-sports-associations-in-singapore-prepare-to-take-annual-general-meetings-into-virtual"}