{"authors": [], "date_download": "2024-10-12 14:12:15", "date_modify": "2024-10-12 14:12:15", "date_publish": "2024-08-02 03:30:16", "description": "French judoka Teddy Riner is out for a 4th Olympic gold medal, while local swimmer Leon Marchand goes for his 4th title of the Games. Read more at straitstimes.com.", "filename": "sport_tennis_whats-happening-on-day-seven-of-paris-games-on-friday_1728742335.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/08/02/LYNXMPEK70264-1.jpg?VersionId=l2oTzROlzwbwoafSHgvUcGuUYw9dxIoF", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_tennis_whats-happening-on-day-seven-of-paris-games-on-friday_1728742335.html", "title": "What's happening on Day 7 of Paris Olympics on Friday", "title_page": "What's happening on Day 7 of Paris Olympics on Friday | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "PARIS - Stade de France's purple track will stage Paris Games athletics' competition on Aug 2 as the world record holder takes on the defending Olympic champion in the men's 10,000m final.\nFrench judoka Teddy Riner, who lit the Olympic cauldron at the opening ceremony with Marie-Jose Perec, will take to the mat in his bid for a fourth Olympic gold medal, while local swimmer Leon Marchand goes for his fourth title of the Games.\nOlympic champions will also be crowned in badminton, equestrian, rowing, windsurfing and shooting.\nTrack action kicks off\nThe first track gold will be awarded in the men's 10,000m, where Uganda's world record holder Joshua Cheptegei and Jacob Kiplimo aim to improve on their Tokyo silver and bronze medals respectively, as Ethiopia's Selemon Barega defends his title.\nCanada's Damian Warner begins the defence of his Olympic decathlon title against a field missing teammate and reigning world champion Pierce Lepage, who announced less than two weeks ago that he was withdrawing with a back injury.\nGermany's Leo Neugebauer has the best score this season.\nMarchand goes for four\nThree medals are up for grabs at La Defense Arena where the fastest man in the pool will be crowned in the 50m freestyle final. The women's 200m backstroke champion will also be decided.\nBut the marquee event will have France fans flocking to the venue to watch their hero Leon Marchand go for a fourth gold at his home Games in the men's 200m individual medley.\nMarchand admitted his body was hurting after the incredible, record-breaking 200m breaststroke and butterfly double in the same session on July 31 but confidently stated that his body would recover in time to add to his tally.\nChina hunt for another diving gold\nChina are on track to pick up a fourth Olympic diving gold in Paris with the men's synchronised 3-metre springboard event.\nLong Daoyi and Wang Zongyuan will defend the title with no visible challengers in sight as the pair have reigned supreme in this event for the last two years.\nMexico's Osmar Olvera and Juan Manuel Celaya Hernandez plus British duo Jack Laugher and Anthony Harding are among the medal contenders.\nFrance see end to medal drought in BMX race\nFrance’s male riders hope the BMX racing finals on home soil will finally bring the Olympic medals that have long eluded them, despite dominating the World Championships since 1982 where they have amassed 50 golds in all classes.\nOn the women’s side, Britain, Colombia, the United States, the Netherlands and host country France are all fielding riders with strong track records.\nFrance and Italy on collision course in fencing\nFans are licking their lips for a potential showdown between historic rivals France and Italy in the men's epee team event for fencing.\nBut the two teams will have to get through preliminary opponents first as Italy face the Czechs and France battle Egypt, with their eyes on the gold medal match set for the evening programme at the stunning Grand Palais venue.\nWide open field in showjumping\nThe world’s top showjumping nations compete in the team finals after Germany had the best results in qualifying.\nUnlike dressage and eventing – where just a few countries tend to dominate – the field in showjumping is fairly open and several nations, also including the United States, Sweden and Ireland, are expected to produce a tight battle for the medals.\nDavid-and-goliath match-up in badminton\nMalaysia's women's doubles underdogs Pearly Tan and Thinaah Muralitharan have delighted fans so far with their hunger to win against the odds and will throw down in the semi-finals with world No. 1 duo Chen Qingchen and Jia Yifan from China.\nReigning Olympic champions Wang Chi-lin and Lee Yang of Chinese Taipei meet Denmark’s Anders Rasmussen and Kim Astrup in their men's doubles semi-final, with the mixed doubles gold medal match set for the evening programme.\nHunting for gold in Women’s rifle\nTwice world champion Sagen Maddalena of the United States aims to add a first Olympic gold to her trophy wall after topping qualification for the women's 50-metre rifle three positions at the Chateauroux Shooting Centre.\nChina's Zhang Qiongyue was hard on her heels with European champion Chiara Leone of Switzerland also in the mix.\nSpotlight on boxing\nTaiwan boxer Lin Yu-ting, who has been in the spotlight after failing a gender eligibility test at last year's World Championships, is in action in a featherweight round of 16 bout.\nDefending super heavyweight champion Bakhodir Jalolov of Uzbekistan takes on up-and-coming Australian Teremoana Junior in what should be a thrilling quarter-final clash.\nHome hopes in focus for judo\nRiner hopes to underline his status as a French sporting great when he chases a third individual Olympic gold in the over-100kg category, beginning with the round of 16, days after lighting Olympic cauldron.\nFrench fans could be spoilt as France’s world No. 1 Romane Dicko is also favourite to win in front of the home crowd in the women's over-78kg category.\nArchery mixed team medal on the line\nSouth Korea are the hot favourites to retain their mixed team archery gold, with France and China hoping to spoil their chances, as the event wraps up its second Olympics.\nKayak goes with the Paris flow\nFriday sees the Olympic debut of kayak cross, a sport full of thrills and spills that pits racers against each other on the course in a race to the bottom.\nThere are also four medals up for grabs in the rowing regatta.\nUS in trouble in 3x3 basketball\nWith only one game per team remaining at the end of Aug 1, Friday’s sessions should reveal the first teams heading to the knockout phase.\nBoth US teams are still in danger of elimination after a poor start, while Tokyo champions Latvia top the men’s pool.\nTrampoline gymnastics springs into action\nThe lone day of trampoline gymnastics will see Britain's world champion Bryony Page face off against the defending Olympic champion Zhu Xueying on the women's side.\nBelarusian Ivan Litvinovich, who won three years ago and accepted an IOC invitation to compete as a neutral athlete, competes in the men's competition along with the Tokyo bronze medallist Dylan Schmidt of New Zealand.\nMedal events in sailing\nRace organisers look set to run the postponed men’s and women’s skiff medals races on Friday. They look likely to take place before the windsurfing final rounds and medals deciders which were already scheduled. REUTERS", "url": "https://www.straitstimes.com/sport/tennis/whats-happening-on-day-seven-of-paris-games-on-friday"}