{"authors": [], "date_download": "2024-10-12 13:40:27", "date_modify": "2024-10-12 13:40:27", "date_publish": "2024-09-09 05:02:04", "description": "OSIJEK, Croatia - Croatia midfielder Luka Modric scored early in the second half to secure a 1-0 home win over Poland in their Nations League A Group 1 clash on Sunday. Read more at straitstimes.com.", "filename": "sport_football_modric-lifts-croatia-to-1-0-win-over-poland_1728740427.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/09/09/LYNXMPEK87084-1.jpg?VersionId=iXgb8ijVz.BbEcLMSD_qUfsdEsWjDPiz", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_football_modric-lifts-croatia-to-1-0-win-over-poland_1728740427.html", "title": "Modric lifts Croatia to 1-0 win over Poland", "title_page": "Modric lifts Croatia to 1-0 win over Poland | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "OSIJEK, Croatia - Croatia midfielder Luka Modric scored early in the second half to secure a 1-0 home win over Poland in their Nations League A Group 1 clash on Sunday.\nModric, who turns 39 on Monday, sealed the win in the 52nd minute with an expertly executed free kick from the edge of the box that sailed just under the bar.\nCroatia pressed from the start, having been beaten 2-1 by Portugal in their Nations League opener on Thursday, but despite early chances for Duje Caleta-Car and Modric the game was goalless at the break.\nThe visitors barely threatened Croatia's box for the majority of the game and home goalkeeper Dominik Livakovic only had to intervene following halftime to deny Nicola Zalewski from Poland's first attempt on goal out of two in total.\nStrikers Igor Matanovic and Robert Lewandowski hit the bar for Croatia and Poland respectively later in the second half.\nPortugal, who came from a goal down to beat Scotland 2-1 in their match, top the group with six points ahead of second-placed Croatia and Poland in third, both with three points. REUTERS", "url": "https://www.straitstimes.com/sport/football/modric-lifts-croatia-to-1-0-win-over-poland"}