{"authors": [], "date_download": "2024-10-12 14:16:26", "date_modify": "2024-10-12 14:16:26", "date_publish": "2024-01-27 00:16:00", "description": "The 24-year-old British driver is a hot property after seven podium appearances last season. Read more at straitstimes.com.", "filename": "sport_formula-one_norris-looked-around-before-committing-to-mclaren_1728742586.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2024/01/27/LYNXMPEK0P0LF-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_norris-looked-around-before-committing-to-mclaren_1728742586.html", "title": "Lando Norris looked around before committing to McLaren", "title_page": "Lando Norris looked around before committing to McLaren | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "LONDON – Lando Norris admitted that he had sounded out other Formula One teams, including champions Red Bull, before committing to McLaren on Jan 26 for the next few years.\nThe 24-year-old British driver is a hot property after seven podium appearances last season and McLaren wasted no time in signing him up until at least the end of 2026 and probably beyond.\nNorris gave plenty of reasons for wanting to stay, including the team’s improvement and feeling like part of the family, and he also recognised the announcement so early in the year was to reassure teammates who might have questioned his loyalty as well.\n“Everyone speaks to everyone. Every driver speaks to every team,” he said of the rumours and speculation that had linked him to rivals.\n“It’s just what can one team offer you and another team offer you and things like that. It’s the same with every driver. Everyone speaks to every team on what could we potentially do one day.\n“But nothing ever progressed more than that. We shut down quite quickly.”\nThe new season that starts in March will see no change of seats from the final race of 2023 but a majority of drivers are out of contract at the end of the year.\nA big “silly season” of speculation about driver moves is looming, with major rule changes in the sport in 2026 and teams seeking stability.\nMcLaren should have that, with Norris and Australian Oscar Piastri now signed up at least to the end of 2026, while Ferrari announced on Jan 25 a multi-year extension for Charles Leclerc.\nRed Bull already have three-time world champion Max Verstappen committed to 2028 but Mexican teammate Sergio Perez’s place is uncertain after 2024.\nRed Bull’s car was so dominant they won 21 out of 22 races last season and Norris admitted to sometimes asking himself whether he was in the right place.\n“Every now and then you’ve got to have that little question of whether this is the place to be to achieve that goal, that next goal that I want which is to be the world champion?” he said.\n“There’s always going to be those things and every driver has them.”\nNorris, who has yet to win a race, said he actually enjoyed reading stories from the rumour mill but it was important also to minimise the distractions as McLaren sought to return to the top.\n“They (his teammates) are now even more assured that I’m committed to the team and staying and that I picked McLaren over Ferrari, Red Bull, Mercedes, whatever team it could have been,” he added.\n“It comes back to where will I be happiest and now where am I most confident I can actually achieve a world championship. If you asked me at the beginning of last year maybe it wouldn’t have been McLaren.\n“But now I think I’m more confident than ever in saying it’s going to be McLaren.” REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/norris-looked-around-before-committing-to-mclaren"}