{"authors": [], "date_download": "2024-10-12 14:16:53", "date_modify": "2024-10-12 14:16:53", "date_publish": "2023-10-08 22:00:20", "description": "Formula One's governing body imposed a mandatory limit on how long tyres could be used for at Sunday's Qatar Grand Prix after Pirelli warned of the risk of sudden blowouts. Read more at straitstimes.com.", "filename": "sport_formula-one_fia-imposes-lap-limit-on-qatar-gp-tyres-for-safety-reasons_1728742613.html", "image_url": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/10/08/LYNXMPEJ9707H-1.jpg", "language": "en", "localpath": "/Users/bryansoong/news-please-repo//data/2024/10/12/straitstimes.com/sport_formula-one_fia-imposes-lap-limit-on-qatar-gp-tyres-for-safety-reasons_1728742613.html", "title": "FIA imposes lap limit on Qatar GP tyres for safety reasons", "title_page": "FIA imposes lap limit on Qatar GP tyres for safety reasons | The Straits Times", "title_rss": "NULL", "source_domain": "straitstimes.com", "maintext": "DOHA - Formula One's governing body imposed a mandatory limit on how long tyres could be used for at Sunday's Qatar Grand Prix after Pirelli warned of the risk of sudden blowouts.\nThe FIA said a limit of 18 laps of total tyre life per set will be imposed for the 57 lap race, effectively making it a three-stopper.\nThe life of already used tyres will be taken into consideration.\n\"Any car deemed to have exceeded the tyre life lap limit will be reported to the stewards as being run in an unsafe condition,\" the governing body added in a statement.\nThe FIA had warned on Saturday, before a 19-lap sprint race, that Sunday's grand prix could become a mandatory three-stop race to limit tyre usage.\nIt has also made revisions to the track limits at turns 12 and 13.\nPirelli's analysis of returned tyres used in Friday's sole practice session found a small separation in the sidewall between the topping compound and the carcass cords on many of those used for around 20 laps.\nThe FIA said the issue had likely been caused by the sidewall coming into contact with the 50mm \"pyramid\" kerbs used at the circuit, with drivers riding the kerbs to get the quickest lap time.\nSaturday's sprint saw three safety car periods at reduced speeds and the FIA said data from that race was insufficient to add to what was already known.\n\"In some cases, tyres that were analysed from the Sprint did show the initial onset of the separation in the sidewall between the topping compound and the carcass cords of the tyres,\" it added.\nMax Verstappen, who clinched his third championship in the sprint, will be starting from pole position. His Red Bull team have already won the constructors' title. REUTERS", "url": "https://www.straitstimes.com/sport/formula-one/fia-imposes-lap-limit-on-qatar-gp-tyres-for-safety-reasons"}